src/Reports/ОстаткиПартийТоваров1/ОстаткиПартийТоваров1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОстаткиПартийТоваров1</name>
</mdclass:Report>

src/AccumulationRegisters/СтоимостьТоваров/СтоимостьТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СтоимостьТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/ОстаткиПартийТоваров1/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
	
	Макет = Отчеты.ОстаткиПартийТоваров1.ПолучитьМакет("Макет");
	ОблШапка = Макет.ПолучитьОбласть("ОблШапка");
	ОблСтрока = Макет.ПолучитьОбласть("ОблСтрока");
	ОблИтоги = Макет.ПолучитьОбласть("ОблИтоги");

	
	ТабДок.Очистить();
	ТабДок.Вывести(ОблШапка);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтоимостьТоваровОстатки.Номенклатура КАК Товар,
	                      |	СтоимостьТоваровОстатки.Партия КАК Партия,
	                      |	СтоимостьТоваровОстатки.КоличествоОстаток КАК Количество,
	                      |	СтоимостьТоваровОстатки.СтоимостьОстаток КАК Стоимость
	                      |ИЗ
	                      |	РегистрНакопления.СтоимостьТоваров.Остатки КАК СтоимостьТоваровОстатки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Товар,
	                      |	СтоимостьТоваровОстатки.Партия.МоментВремени УБЫВ
	                      |ИТОГИ
	                      |	СУММА(Количество),
	                      |	СУММА(Стоимость)
	                      |ПО
	                      |	Товар
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Результат = Запрос.Выполнить();
	ВыборкаИтоги = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаИтоги.Следующий() Цикл
		Выборка = ВыборкаИтоги.Выбрать();
		Пока Выборка.Следующий() Цикл
			ОблСтрока.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОблСтрока);
		КонецЦикла; 
		
	    ОблИтоги.Параметры.Заполнить(ВыборкаИтоги);
		ТабДок.Вывести(ОблИтоги);
	КонецЦикла;  
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры
